Microchip-MPLAB-Harmony/reference_apps/apps/pic32cx_sg61_cult/pic32cx_sg61_getting_started/firmware/src/packs/PIC32CX1025SG61128_DFP/pio/pic32cx1025sg61128.h
#define PIN_PB05B_ADC1_AIN7                        _UINT32_(37)
#define MUX_PB05B_ADC1_AIN7                        _UINT32_(1) 
#define PINMUX_PB05B_ADC1_AIN7                     ((PIN_PB05B_ADC1_AIN7 << 16) | MUX_PB05B_ADC1_AIN7)
#define PORT_PB05B_ADC1_AIN7                       (_UINT32_(1) << 5)

#define PIN_PB06B_ADC1_AIN8                        _UINT32_(38)
#define MUX_PB06B_ADC1_AIN8                        _UINT32_(1) 
#define PINMUX_PB06B_ADC1_AIN8                     ((PIN_PB06B_ADC1_AIN8 << 16) | MUX_PB06B_ADC1_AIN8)
#define PORT_PB06B_ADC1_AIN8                       (_UINT32_(1) << 6)

#define PIN_PB07B_ADC1_AIN9                        _UINT32_(39)
#define MUX_PB07B_ADC1_AIN9                        _UINT32_(1) 
#define PINMUX_PB07B_ADC1_AIN9                     ((PIN_PB07B_ADC1_AIN9 << 16) | MUX_PB07B_ADC1_AIN9)
#define PORT_PB07B_ADC1_AIN9                       (_UINT32_(1) << 7)

#define PIN_PC00B_ADC1_AIN10                       _UINT32_(64)
#define MUX_PC00B_ADC1_AIN10                       _UINT32_(1) 
#define PINMUX_PC00B_ADC1_AIN10                    ((PIN_PC00B_ADC1_AIN10 << 16) | MUX_PC00B_ADC1_AIN10)
#define PORT_PC00B_ADC1_AIN10                      (_UINT32_(1) << 0)

#define PIN_PC01B_ADC1_AIN11                       _UINT32_(65)
#define MUX_PC01B_ADC1_AIN11                       _UINT32_(1) 
#define PINMUX_PC01B_ADC1_AIN11                    ((PIN_PC01B_ADC1_AIN11 << 16) | MUX_PC01B_ADC1_AIN11)
#define PORT_PC01B_ADC1_AIN11                      (_UINT32_(1) << 1)

#define PIN_PC30B_ADC1_AIN12                       _UINT32_(94)
#define MUX_PC30B_ADC1_AIN12                       _UINT32_(1) 
#define PINMUX_PC30B_ADC1_AIN12                    ((PIN_PC30B_ADC1_AIN12 << 16) | MUX_PC30B_ADC1_AIN12)
#define PORT_PC30B_ADC1_AIN12                      (_UINT32_(1) << 30)

#define PIN_PC31B_ADC1_AIN13                       _UINT32_(95)
#define MUX_PC31B_ADC1_AIN13                       _UINT32_(1) 
#define PINMUX_PC31B_ADC1_AIN13                    ((PIN_PC31B_ADC1_AIN13 << 16) | MUX_PC31B_ADC1_AIN13)
#define PORT_PC31B_ADC1_AIN13                      (_UINT32_(1) << 31)

#define PIN_PD00B_ADC1_AIN14                       _UINT32_(96)
#define MUX_PD00B_ADC1_AIN14                       _UINT32_(1) 
#define PINMUX_PD00B_ADC1_AIN14                    ((PIN_PD00B_ADC1_AIN14 << 16) | MUX_PD00B_ADC1_AIN14)
#define PORT_PD00B_ADC1_AIN14                      (_UINT32_(1) << 0)

#define PIN_PD01B_ADC1_AIN15                       _UINT32_(97)
#define MUX_PD01B_ADC1_AIN15                       _UINT32_(1) 
#define PINMUX_PD01B_ADC1_AIN15                    ((PIN_PD01B_ADC1_AIN15 << 16) | MUX_PD01B_ADC1_AIN15)
#define PORT_PD01B_ADC1_AIN15                      (_UINT32_(1) << 1)

/* ========== PORT definition for CAN0 peripheral ========== */
#define PIN_PA23I_CAN0_RX                          _UINT32_(23)
#define MUX_PA23I_CAN0_RX                          _UINT32_(8) 
#define PINMUX_PA23I_CAN0_RX                       ((PIN_PA23I_CAN0_RX << 16) | MUX_PA23I_CAN0_RX)
#define PORT_PA23I_CAN0_RX                         (_UINT32_(1) << 23)

#define PIN_PA25I_CAN0_RX                          _UINT32_(25)
#define MUX_PA25I_CAN0_RX                          _UINT32_(8) 
#define PINMUX_PA25I_CAN0_RX                       ((PIN_PA25I_CAN0_RX << 16) | MUX_PA25I_CAN0_RX)
#define PORT_PA25I_CAN0_RX                         (_UINT32_(1) << 25)

#define PIN_PA22I_CAN0_TX                          _UINT32_(22)
#define MUX_PA22I_CAN0_TX                          _UINT32_(8) 
#define PINMUX_PA22I_CAN0_TX                       ((PIN_PA22I_CAN0_TX << 16) | MUX_PA22I_CAN0_TX)
#define PORT_PA22I_CAN0_TX                         (_UINT32_(1) << 22)

#define PIN_PA24I_CAN0_TX                          _UINT32_(24)
#define MUX_PA24I_CAN0_TX                          _UINT32_(8) 
#define PINMUX_PA24I_CAN0_TX                       ((PIN_PA24I_CAN0_TX << 16) | MUX_PA24I_CAN0_TX)
#define PORT_PA24I_CAN0_TX                         (_UINT32_(1) << 24)

/* ========== PORT definition for CAN1 peripheral ========== */
#define PIN_PB13H_CAN1_RX                          _UINT32_(45)
#define MUX_PB13H_CAN1_RX                          _UINT32_(7) 
#define PINMUX_PB13H_CAN1_RX                       ((PIN_PB13H_CAN1_RX << 16) | MUX_PB13H_CAN1_RX)
#define PORT_PB13H_CAN1_RX                         (_UINT32_(1) << 13)

#define PIN_PB15H_CAN1_RX                          _UINT32_(47)
#define MUX_PB15H_CAN1_RX                          _UINT32_(7) 
#define PINMUX_PB15H_CAN1_RX                       ((PIN_PB15H_CAN1_RX << 16) | MUX_PB15H_CAN1_RX)
#define PORT_PB15H_CAN1_RX                         (_UINT32_(1) << 15)

#define PIN_PB12H_CAN1_TX                          _UINT32_(44)
#define MUX_PB12H_CAN1_TX                          _UINT32_(7) 
#define PINMUX_PB12H_CAN1_TX                       ((PIN_PB12H_CAN1_TX << 16) | MUX_PB12H_CAN1_TX)
#define PORT_PB12H_CAN1_TX                         (_UINT32_(1) << 12)

#define PIN_PB14H_CAN1_TX                          _UINT32_(46)
#define MUX_PB14H_CAN1_TX                          _UINT32_(7) 
#define PINMUX_PB14H_CAN1_TX                       ((PIN_PB14H_CAN1_TX << 16) | MUX_PB14H_CAN1_TX)
#define PORT_PB14H_CAN1_TX                         (_UINT32_(1) << 14)

/* ========== PORT definition for CCL peripheral ========== */
#define PIN_PA04N_CCL_IN0                          _UINT32_(4) 
#define MUX_PA04N_CCL_IN0                          _UINT32_(13)
#define PINMUX_PA04N_CCL_IN0                       ((PIN_PA04N_CCL_IN0 << 16) | MUX_PA04N_CCL_IN0)
#define PORT_PA04N_CCL_IN0                         (_UINT32_(1) << 4)

#define PIN_PA16N_CCL_IN0                          _UINT32_(16)
#define MUX_PA16N_CCL_IN0                          _UINT32_(13)
#define PINMUX_PA16N_CCL_IN0                       ((PIN_PA16N_CCL_IN0 << 16) | MUX_PA16N_CCL_IN0)
#define PORT_PA16N_CCL_IN0                         (_UINT32_(1) << 16)

#define PIN_PB22N_CCL_IN0                          _UINT32_(54)
#define MUX_PB22N_CCL_IN0                          _UINT32_(13)
#define PINMUX_PB22N_CCL_IN0                       ((PIN_PB22N_CCL_IN0 << 16) | MUX_PB22N_CCL_IN0)
#define PORT_PB22N_CCL_IN0                         (_UINT32_(1) << 22)

#define PIN_PA05N_CCL_IN1                          _UINT32_(5) 
#define MUX_PA05N_CCL_IN1                          _UINT32_(13)
#define PINMUX_PA05N_CCL_IN1                       ((PIN_PA05N_CCL_IN1 << 16) | MUX_PA05N_CCL_IN1)
#define PORT_PA05N_CCL_IN1                         (_UINT32_(1) << 5)

#define PIN_PA17N_CCL_IN1                          _UINT32_(17)
#define MUX_PA17N_CCL_IN1                          _UINT32_(13)
#define PINMUX_PA17N_CCL_IN1                       ((PIN_PA17N_CCL_IN1 << 16) | MUX_PA17N_CCL_IN1)
#define PORT_PA17N_CCL_IN1                         (_UINT32_(1) << 17)

#define PIN_PB00N_CCL_IN1                          _UINT32_(32)
#define MUX_PB00N_CCL_IN1                          _UINT32_(13)
#define PINMUX_PB00N_CCL_IN1                       ((PIN_PB00N_CCL_IN1 << 16) | MUX_PB00N_CCL_IN1)
#define PORT_PB00N_CCL_IN1                         (_UINT32_(1) << 0)

