Microchip-MPLAB-Harmony/reference_apps/apps/pic32cx_sg61_cult/pic32cx_sg61_getting_started/firmware/src/packs/PIC32CX1025SG61128_DFP/pio/pic32cx1025sg61128.h
#define PIN_PD21C_SERCOM1_PAD3                     _UINT32_(117)
#define MUX_PD21C_SERCOM1_PAD3                     _UINT32_(2) 
#define PINMUX_PD21C_SERCOM1_PAD3                  ((PIN_PD21C_SERCOM1_PAD3 << 16) | MUX_PD21C_SERCOM1_PAD3)
#define PORT_PD21C_SERCOM1_PAD3                    (_UINT32_(1) << 21)

/* ========== PORT definition for SERCOM2 peripheral ========== */
#define PIN_PA09D_SERCOM2_PAD0                     _UINT32_(9) 
#define MUX_PA09D_SERCOM2_PAD0                     _UINT32_(3) 
#define PINMUX_PA09D_SERCOM2_PAD0                  ((PIN_PA09D_SERCOM2_PAD0 << 16) | MUX_PA09D_SERCOM2_PAD0)
#define PORT_PA09D_SERCOM2_PAD0                    (_UINT32_(1) << 9)

#define PIN_PB25D_SERCOM2_PAD0                     _UINT32_(57)
#define MUX_PB25D_SERCOM2_PAD0                     _UINT32_(3) 
#define PINMUX_PB25D_SERCOM2_PAD0                  ((PIN_PB25D_SERCOM2_PAD0 << 16) | MUX_PB25D_SERCOM2_PAD0)
#define PORT_PB25D_SERCOM2_PAD0                    (_UINT32_(1) << 25)

#define PIN_PA12C_SERCOM2_PAD0                     _UINT32_(12)
#define MUX_PA12C_SERCOM2_PAD0                     _UINT32_(2) 
#define PINMUX_PA12C_SERCOM2_PAD0                  ((PIN_PA12C_SERCOM2_PAD0 << 16) | MUX_PA12C_SERCOM2_PAD0)
#define PORT_PA12C_SERCOM2_PAD0                    (_UINT32_(1) << 12)

#define PIN_PB26C_SERCOM2_PAD0                     _UINT32_(58)
#define MUX_PB26C_SERCOM2_PAD0                     _UINT32_(2) 
#define PINMUX_PB26C_SERCOM2_PAD0                  ((PIN_PB26C_SERCOM2_PAD0 << 16) | MUX_PB26C_SERCOM2_PAD0)
#define PORT_PB26C_SERCOM2_PAD0                    (_UINT32_(1) << 26)

#define PIN_PA08D_SERCOM2_PAD1                     _UINT32_(8) 
#define MUX_PA08D_SERCOM2_PAD1                     _UINT32_(3) 
#define PINMUX_PA08D_SERCOM2_PAD1                  ((PIN_PA08D_SERCOM2_PAD1 << 16) | MUX_PA08D_SERCOM2_PAD1)
#define PORT_PA08D_SERCOM2_PAD1                    (_UINT32_(1) << 8)

#define PIN_PB24D_SERCOM2_PAD1                     _UINT32_(56)
#define MUX_PB24D_SERCOM2_PAD1                     _UINT32_(3) 
#define PINMUX_PB24D_SERCOM2_PAD1                  ((PIN_PB24D_SERCOM2_PAD1 << 16) | MUX_PB24D_SERCOM2_PAD1)
#define PORT_PB24D_SERCOM2_PAD1                    (_UINT32_(1) << 24)

#define PIN_PA13C_SERCOM2_PAD1                     _UINT32_(13)
#define MUX_PA13C_SERCOM2_PAD1                     _UINT32_(2) 
#define PINMUX_PA13C_SERCOM2_PAD1                  ((PIN_PA13C_SERCOM2_PAD1 << 16) | MUX_PA13C_SERCOM2_PAD1)
#define PORT_PA13C_SERCOM2_PAD1                    (_UINT32_(1) << 13)

#define PIN_PB27C_SERCOM2_PAD1                     _UINT32_(59)
#define MUX_PB27C_SERCOM2_PAD1                     _UINT32_(2) 
#define PINMUX_PB27C_SERCOM2_PAD1                  ((PIN_PB27C_SERCOM2_PAD1 << 16) | MUX_PB27C_SERCOM2_PAD1)
#define PORT_PB27C_SERCOM2_PAD1                    (_UINT32_(1) << 27)

#define PIN_PA10D_SERCOM2_PAD2                     _UINT32_(10)
#define MUX_PA10D_SERCOM2_PAD2                     _UINT32_(3) 
#define PINMUX_PA10D_SERCOM2_PAD2                  ((PIN_PA10D_SERCOM2_PAD2 << 16) | MUX_PA10D_SERCOM2_PAD2)
#define PORT_PA10D_SERCOM2_PAD2                    (_UINT32_(1) << 10)

#define PIN_PC24D_SERCOM2_PAD2                     _UINT32_(88)
#define MUX_PC24D_SERCOM2_PAD2                     _UINT32_(3) 
#define PINMUX_PC24D_SERCOM2_PAD2                  ((PIN_PC24D_SERCOM2_PAD2 << 16) | MUX_PC24D_SERCOM2_PAD2)
#define PORT_PC24D_SERCOM2_PAD2                    (_UINT32_(1) << 24)

#define PIN_PB28C_SERCOM2_PAD2                     _UINT32_(60)
#define MUX_PB28C_SERCOM2_PAD2                     _UINT32_(2) 
#define PINMUX_PB28C_SERCOM2_PAD2                  ((PIN_PB28C_SERCOM2_PAD2 << 16) | MUX_PB28C_SERCOM2_PAD2)
#define PORT_PB28C_SERCOM2_PAD2                    (_UINT32_(1) << 28)

#define PIN_PA14C_SERCOM2_PAD2                     _UINT32_(14)
#define MUX_PA14C_SERCOM2_PAD2                     _UINT32_(2) 
#define PINMUX_PA14C_SERCOM2_PAD2                  ((PIN_PA14C_SERCOM2_PAD2 << 16) | MUX_PA14C_SERCOM2_PAD2)
#define PORT_PA14C_SERCOM2_PAD2                    (_UINT32_(1) << 14)

#define PIN_PA11D_SERCOM2_PAD3                     _UINT32_(11)
#define MUX_PA11D_SERCOM2_PAD3                     _UINT32_(3) 
#define PINMUX_PA11D_SERCOM2_PAD3                  ((PIN_PA11D_SERCOM2_PAD3 << 16) | MUX_PA11D_SERCOM2_PAD3)
#define PORT_PA11D_SERCOM2_PAD3                    (_UINT32_(1) << 11)

#define PIN_PC25D_SERCOM2_PAD3                     _UINT32_(89)
#define MUX_PC25D_SERCOM2_PAD3                     _UINT32_(3) 
#define PINMUX_PC25D_SERCOM2_PAD3                  ((PIN_PC25D_SERCOM2_PAD3 << 16) | MUX_PC25D_SERCOM2_PAD3)
#define PORT_PC25D_SERCOM2_PAD3                    (_UINT32_(1) << 25)

#define PIN_PA15C_SERCOM2_PAD3                     _UINT32_(15)
#define MUX_PA15C_SERCOM2_PAD3                     _UINT32_(2) 
#define PINMUX_PA15C_SERCOM2_PAD3                  ((PIN_PA15C_SERCOM2_PAD3 << 16) | MUX_PA15C_SERCOM2_PAD3)
#define PORT_PA15C_SERCOM2_PAD3                    (_UINT32_(1) << 15)

/* ========== PORT definition for SERCOM3 peripheral ========== */
#define PIN_PA17D_SERCOM3_PAD0                     _UINT32_(17)
#define MUX_PA17D_SERCOM3_PAD0                     _UINT32_(3) 
#define PINMUX_PA17D_SERCOM3_PAD0                  ((PIN_PA17D_SERCOM3_PAD0 << 16) | MUX_PA17D_SERCOM3_PAD0)
#define PORT_PA17D_SERCOM3_PAD0                    (_UINT32_(1) << 17)

#define PIN_PC23D_SERCOM3_PAD0                     _UINT32_(87)
#define MUX_PC23D_SERCOM3_PAD0                     _UINT32_(3) 
#define PINMUX_PC23D_SERCOM3_PAD0                  ((PIN_PC23D_SERCOM3_PAD0 << 16) | MUX_PC23D_SERCOM3_PAD0)
#define PORT_PC23D_SERCOM3_PAD0                    (_UINT32_(1) << 23)

#define PIN_PA22C_SERCOM3_PAD0                     _UINT32_(22)
#define MUX_PA22C_SERCOM3_PAD0                     _UINT32_(2) 
#define PINMUX_PA22C_SERCOM3_PAD0                  ((PIN_PA22C_SERCOM3_PAD0 << 16) | MUX_PA22C_SERCOM3_PAD0)
#define PORT_PA22C_SERCOM3_PAD0                    (_UINT32_(1) << 22)

#define PIN_PB20C_SERCOM3_PAD0                     _UINT32_(52)
#define MUX_PB20C_SERCOM3_PAD0                     _UINT32_(2) 
#define PINMUX_PB20C_SERCOM3_PAD0                  ((PIN_PB20C_SERCOM3_PAD0 << 16) | MUX_PB20C_SERCOM3_PAD0)
#define PORT_PB20C_SERCOM3_PAD0                    (_UINT32_(1) << 20)

