Microchip-MPLAB-Harmony/reference_apps/apps/pic32cx_sg61_cult/pic32cx_sg61_getting_started/firmware/src/packs/PIC32CX1025SG61128_DFP/pio/pic32cx1025sg61128.h
#define PIN_PD08D_SERCOM6_PAD1                     _UINT32_(104)
#define MUX_PD08D_SERCOM6_PAD1                     _UINT32_(3) 
#define PINMUX_PD08D_SERCOM6_PAD1                  ((PIN_PD08D_SERCOM6_PAD1 << 16) | MUX_PD08D_SERCOM6_PAD1)
#define PORT_PD08D_SERCOM6_PAD1                    (_UINT32_(1) << 8)

#define PIN_PC12D_SERCOM6_PAD1                     _UINT32_(76)
#define MUX_PC12D_SERCOM6_PAD1                     _UINT32_(3) 
#define PINMUX_PC12D_SERCOM6_PAD1                  ((PIN_PC12D_SERCOM6_PAD1 << 16) | MUX_PC12D_SERCOM6_PAD1)
#define PORT_PC12D_SERCOM6_PAD1                    (_UINT32_(1) << 12)

#define PIN_PC05C_SERCOM6_PAD1                     _UINT32_(69)
#define MUX_PC05C_SERCOM6_PAD1                     _UINT32_(2) 
#define PINMUX_PC05C_SERCOM6_PAD1                  ((PIN_PC05C_SERCOM6_PAD1 << 16) | MUX_PC05C_SERCOM6_PAD1)
#define PORT_PC05C_SERCOM6_PAD1                    (_UINT32_(1) << 5)

#define PIN_PC17C_SERCOM6_PAD1                     _UINT32_(81)
#define MUX_PC17C_SERCOM6_PAD1                     _UINT32_(2) 
#define PINMUX_PC17C_SERCOM6_PAD1                  ((PIN_PC17C_SERCOM6_PAD1 << 16) | MUX_PC17C_SERCOM6_PAD1)
#define PORT_PC17C_SERCOM6_PAD1                    (_UINT32_(1) << 17)

#define PIN_PC14D_SERCOM6_PAD2                     _UINT32_(78)
#define MUX_PC14D_SERCOM6_PAD2                     _UINT32_(3) 
#define PINMUX_PC14D_SERCOM6_PAD2                  ((PIN_PC14D_SERCOM6_PAD2 << 16) | MUX_PC14D_SERCOM6_PAD2)
#define PORT_PC14D_SERCOM6_PAD2                    (_UINT32_(1) << 14)

#define PIN_PD10D_SERCOM6_PAD2                     _UINT32_(106)
#define MUX_PD10D_SERCOM6_PAD2                     _UINT32_(3) 
#define PINMUX_PD10D_SERCOM6_PAD2                  ((PIN_PD10D_SERCOM6_PAD2 << 16) | MUX_PD10D_SERCOM6_PAD2)
#define PORT_PD10D_SERCOM6_PAD2                    (_UINT32_(1) << 10)

#define PIN_PC06C_SERCOM6_PAD2                     _UINT32_(70)
#define MUX_PC06C_SERCOM6_PAD2                     _UINT32_(2) 
#define PINMUX_PC06C_SERCOM6_PAD2                  ((PIN_PC06C_SERCOM6_PAD2 << 16) | MUX_PC06C_SERCOM6_PAD2)
#define PORT_PC06C_SERCOM6_PAD2                    (_UINT32_(1) << 6)

#define PIN_PC10C_SERCOM6_PAD2                     _UINT32_(74)
#define MUX_PC10C_SERCOM6_PAD2                     _UINT32_(2) 
#define PINMUX_PC10C_SERCOM6_PAD2                  ((PIN_PC10C_SERCOM6_PAD2 << 16) | MUX_PC10C_SERCOM6_PAD2)
#define PORT_PC10C_SERCOM6_PAD2                    (_UINT32_(1) << 10)

#define PIN_PC18C_SERCOM6_PAD2                     _UINT32_(82)
#define MUX_PC18C_SERCOM6_PAD2                     _UINT32_(2) 
#define PINMUX_PC18C_SERCOM6_PAD2                  ((PIN_PC18C_SERCOM6_PAD2 << 16) | MUX_PC18C_SERCOM6_PAD2)
#define PORT_PC18C_SERCOM6_PAD2                    (_UINT32_(1) << 18)

#define PIN_PC15D_SERCOM6_PAD3                     _UINT32_(79)
#define MUX_PC15D_SERCOM6_PAD3                     _UINT32_(3) 
#define PINMUX_PC15D_SERCOM6_PAD3                  ((PIN_PC15D_SERCOM6_PAD3 << 16) | MUX_PC15D_SERCOM6_PAD3)
#define PORT_PC15D_SERCOM6_PAD3                    (_UINT32_(1) << 15)

#define PIN_PD11D_SERCOM6_PAD3                     _UINT32_(107)
#define MUX_PD11D_SERCOM6_PAD3                     _UINT32_(3) 
#define PINMUX_PD11D_SERCOM6_PAD3                  ((PIN_PD11D_SERCOM6_PAD3 << 16) | MUX_PD11D_SERCOM6_PAD3)
#define PORT_PD11D_SERCOM6_PAD3                    (_UINT32_(1) << 11)

#define PIN_PC07C_SERCOM6_PAD3                     _UINT32_(71)
#define MUX_PC07C_SERCOM6_PAD3                     _UINT32_(2) 
#define PINMUX_PC07C_SERCOM6_PAD3                  ((PIN_PC07C_SERCOM6_PAD3 << 16) | MUX_PC07C_SERCOM6_PAD3)
#define PORT_PC07C_SERCOM6_PAD3                    (_UINT32_(1) << 7)

#define PIN_PC11C_SERCOM6_PAD3                     _UINT32_(75)
#define MUX_PC11C_SERCOM6_PAD3                     _UINT32_(2) 
#define PINMUX_PC11C_SERCOM6_PAD3                  ((PIN_PC11C_SERCOM6_PAD3 << 16) | MUX_PC11C_SERCOM6_PAD3)
#define PORT_PC11C_SERCOM6_PAD3                    (_UINT32_(1) << 11)

#define PIN_PC19C_SERCOM6_PAD3                     _UINT32_(83)
#define MUX_PC19C_SERCOM6_PAD3                     _UINT32_(2) 
#define PINMUX_PC19C_SERCOM6_PAD3                  ((PIN_PC19C_SERCOM6_PAD3 << 16) | MUX_PC19C_SERCOM6_PAD3)
#define PORT_PC19C_SERCOM6_PAD3                    (_UINT32_(1) << 19)

/* ========== PORT definition for SERCOM7 peripheral ========== */
#define PIN_PB21D_SERCOM7_PAD0                     _UINT32_(53)
#define MUX_PB21D_SERCOM7_PAD0                     _UINT32_(3) 
#define PINMUX_PB21D_SERCOM7_PAD0                  ((PIN_PB21D_SERCOM7_PAD0 << 16) | MUX_PB21D_SERCOM7_PAD0)
#define PORT_PB21D_SERCOM7_PAD0                    (_UINT32_(1) << 21)

#define PIN_PD08C_SERCOM7_PAD0                     _UINT32_(104)
#define MUX_PD08C_SERCOM7_PAD0                     _UINT32_(2) 
#define PINMUX_PD08C_SERCOM7_PAD0                  ((PIN_PD08C_SERCOM7_PAD0 << 16) | MUX_PD08C_SERCOM7_PAD0)
#define PORT_PD08C_SERCOM7_PAD0                    (_UINT32_(1) << 8)

#define PIN_PB30C_SERCOM7_PAD0                     _UINT32_(62)
#define MUX_PB30C_SERCOM7_PAD0                     _UINT32_(2) 
#define PINMUX_PB30C_SERCOM7_PAD0                  ((PIN_PB30C_SERCOM7_PAD0 << 16) | MUX_PB30C_SERCOM7_PAD0)
#define PORT_PB30C_SERCOM7_PAD0                    (_UINT32_(1) << 30)

#define PIN_PC12C_SERCOM7_PAD0                     _UINT32_(76)
#define MUX_PC12C_SERCOM7_PAD0                     _UINT32_(2) 
#define PINMUX_PC12C_SERCOM7_PAD0                  ((PIN_PC12C_SERCOM7_PAD0 << 16) | MUX_PC12C_SERCOM7_PAD0)
#define PORT_PC12C_SERCOM7_PAD0                    (_UINT32_(1) << 12)

#define PIN_PB20D_SERCOM7_PAD1                     _UINT32_(52)
#define MUX_PB20D_SERCOM7_PAD1                     _UINT32_(3) 
#define PINMUX_PB20D_SERCOM7_PAD1                  ((PIN_PB20D_SERCOM7_PAD1 << 16) | MUX_PB20D_SERCOM7_PAD1)
#define PORT_PB20D_SERCOM7_PAD1                    (_UINT32_(1) << 20)

#define PIN_PD09C_SERCOM7_PAD1                     _UINT32_(105)
#define MUX_PD09C_SERCOM7_PAD1                     _UINT32_(2) 
#define PINMUX_PD09C_SERCOM7_PAD1                  ((PIN_PD09C_SERCOM7_PAD1 << 16) | MUX_PD09C_SERCOM7_PAD1)
#define PORT_PD09C_SERCOM7_PAD1                    (_UINT32_(1) << 9)

#define PIN_PB31C_SERCOM7_PAD1                     _UINT32_(63)
#define MUX_PB31C_SERCOM7_PAD1                     _UINT32_(2) 
#define PINMUX_PB31C_SERCOM7_PAD1                  ((PIN_PB31C_SERCOM7_PAD1 << 16) | MUX_PB31C_SERCOM7_PAD1)
#define PORT_PB31C_SERCOM7_PAD1                    (_UINT32_(1) << 31)

#define PIN_PC13C_SERCOM7_PAD1                     _UINT32_(77)
#define MUX_PC13C_SERCOM7_PAD1                     _UINT32_(2) 
#define PINMUX_PC13C_SERCOM7_PAD1                  ((PIN_PC13C_SERCOM7_PAD1 << 16) | MUX_PC13C_SERCOM7_PAD1)
#define PORT_PC13C_SERCOM7_PAD1                    (_UINT32_(1) << 13)

#define PIN_PB18D_SERCOM7_PAD2                     _UINT32_(50)
#define MUX_PB18D_SERCOM7_PAD2                     _UINT32_(3) 
#define PINMUX_PB18D_SERCOM7_PAD2                  ((PIN_PB18D_SERCOM7_PAD2 << 16) | MUX_PB18D_SERCOM7_PAD2)
#define PORT_PB18D_SERCOM7_PAD2                    (_UINT32_(1) << 18)

