Microchip-MPLAB-Harmony/reference_apps/apps/pic32cx_sg61_cult/pic32cx_sg61_getting_started/firmware/src/packs/PIC32CX1025SG61128_DFP/pio/pic32cx1025sg61128.h
/* ========== PORT definition for TC6 peripheral ========== */
#define PIN_PA30E_TC6_WO0                          _UINT32_(30)
#define MUX_PA30E_TC6_WO0                          _UINT32_(4) 
#define PINMUX_PA30E_TC6_WO0                       ((PIN_PA30E_TC6_WO0 << 16) | MUX_PA30E_TC6_WO0)
#define PORT_PA30E_TC6_WO0                         (_UINT32_(1) << 30)

#define PIN_PB02E_TC6_WO0                          _UINT32_(34)
#define MUX_PB02E_TC6_WO0                          _UINT32_(4) 
#define PINMUX_PB02E_TC6_WO0                       ((PIN_PB02E_TC6_WO0 << 16) | MUX_PB02E_TC6_WO0)
#define PORT_PB02E_TC6_WO0                         (_UINT32_(1) << 2)

#define PIN_PB16E_TC6_WO0                          _UINT32_(48)
#define MUX_PB16E_TC6_WO0                          _UINT32_(4) 
#define PINMUX_PB16E_TC6_WO0                       ((PIN_PB16E_TC6_WO0 << 16) | MUX_PB16E_TC6_WO0)
#define PORT_PB16E_TC6_WO0                         (_UINT32_(1) << 16)

#define PIN_PA31E_TC6_WO1                          _UINT32_(31)
#define MUX_PA31E_TC6_WO1                          _UINT32_(4) 
#define PINMUX_PA31E_TC6_WO1                       ((PIN_PA31E_TC6_WO1 << 16) | MUX_PA31E_TC6_WO1)
#define PORT_PA31E_TC6_WO1                         (_UINT32_(1) << 31)

#define PIN_PB03E_TC6_WO1                          _UINT32_(35)
#define MUX_PB03E_TC6_WO1                          _UINT32_(4) 
#define PINMUX_PB03E_TC6_WO1                       ((PIN_PB03E_TC6_WO1 << 16) | MUX_PB03E_TC6_WO1)
#define PORT_PB03E_TC6_WO1                         (_UINT32_(1) << 3)

#define PIN_PB17E_TC6_WO1                          _UINT32_(49)
#define MUX_PB17E_TC6_WO1                          _UINT32_(4) 
#define PINMUX_PB17E_TC6_WO1                       ((PIN_PB17E_TC6_WO1 << 16) | MUX_PB17E_TC6_WO1)
#define PORT_PB17E_TC6_WO1                         (_UINT32_(1) << 17)

/* ========== PORT definition for TC7 peripheral ========== */
#define PIN_PA20E_TC7_WO0                          _UINT32_(20)
#define MUX_PA20E_TC7_WO0                          _UINT32_(4) 
#define PINMUX_PA20E_TC7_WO0                       ((PIN_PA20E_TC7_WO0 << 16) | MUX_PA20E_TC7_WO0)
#define PORT_PA20E_TC7_WO0                         (_UINT32_(1) << 20)

#define PIN_PB00E_TC7_WO0                          _UINT32_(32)
#define MUX_PB00E_TC7_WO0                          _UINT32_(4) 
#define PINMUX_PB00E_TC7_WO0                       ((PIN_PB00E_TC7_WO0 << 16) | MUX_PB00E_TC7_WO0)
#define PORT_PB00E_TC7_WO0                         (_UINT32_(1) << 0)

#define PIN_PB22E_TC7_WO0                          _UINT32_(54)
#define MUX_PB22E_TC7_WO0                          _UINT32_(4) 
#define PINMUX_PB22E_TC7_WO0                       ((PIN_PB22E_TC7_WO0 << 16) | MUX_PB22E_TC7_WO0)
#define PORT_PB22E_TC7_WO0                         (_UINT32_(1) << 22)

#define PIN_PA21E_TC7_WO1                          _UINT32_(21)
#define MUX_PA21E_TC7_WO1                          _UINT32_(4) 
#define PINMUX_PA21E_TC7_WO1                       ((PIN_PA21E_TC7_WO1 << 16) | MUX_PA21E_TC7_WO1)
#define PORT_PA21E_TC7_WO1                         (_UINT32_(1) << 21)

#define PIN_PB01E_TC7_WO1                          _UINT32_(33)
#define MUX_PB01E_TC7_WO1                          _UINT32_(4) 
#define PINMUX_PB01E_TC7_WO1                       ((PIN_PB01E_TC7_WO1 << 16) | MUX_PB01E_TC7_WO1)
#define PORT_PB01E_TC7_WO1                         (_UINT32_(1) << 1)

#define PIN_PB23E_TC7_WO1                          _UINT32_(55)
#define MUX_PB23E_TC7_WO1                          _UINT32_(4) 
#define PINMUX_PB23E_TC7_WO1                       ((PIN_PB23E_TC7_WO1 << 16) | MUX_PB23E_TC7_WO1)
#define PORT_PB23E_TC7_WO1                         (_UINT32_(1) << 23)

/* ========== PORT definition for TCC0 peripheral ========== */
#define PIN_PA20G_TCC0_WO0                         _UINT32_(20)
#define MUX_PA20G_TCC0_WO0                         _UINT32_(6) 
#define PINMUX_PA20G_TCC0_WO0                      ((PIN_PA20G_TCC0_WO0 << 16) | MUX_PA20G_TCC0_WO0)
#define PORT_PA20G_TCC0_WO0                        (_UINT32_(1) << 20)

#define PIN_PB12G_TCC0_WO0                         _UINT32_(44)
#define MUX_PB12G_TCC0_WO0                         _UINT32_(6) 
#define PINMUX_PB12G_TCC0_WO0                      ((PIN_PB12G_TCC0_WO0 << 16) | MUX_PB12G_TCC0_WO0)
#define PORT_PB12G_TCC0_WO0                        (_UINT32_(1) << 12)

#define PIN_PA08F_TCC0_WO0                         _UINT32_(8) 
#define MUX_PA08F_TCC0_WO0                         _UINT32_(5) 
#define PINMUX_PA08F_TCC0_WO0                      ((PIN_PA08F_TCC0_WO0 << 16) | MUX_PA08F_TCC0_WO0)
#define PORT_PA08F_TCC0_WO0                        (_UINT32_(1) << 8)

#define PIN_PC10F_TCC0_WO0                         _UINT32_(74)
#define MUX_PC10F_TCC0_WO0                         _UINT32_(5) 
#define PINMUX_PC10F_TCC0_WO0                      ((PIN_PC10F_TCC0_WO0 << 16) | MUX_PC10F_TCC0_WO0)
#define PORT_PC10F_TCC0_WO0                        (_UINT32_(1) << 10)

#define PIN_PC16F_TCC0_WO0                         _UINT32_(80)
#define MUX_PC16F_TCC0_WO0                         _UINT32_(5) 
#define PINMUX_PC16F_TCC0_WO0                      ((PIN_PC16F_TCC0_WO0 << 16) | MUX_PC16F_TCC0_WO0)
#define PORT_PC16F_TCC0_WO0                        (_UINT32_(1) << 16)

#define PIN_PA21G_TCC0_WO1                         _UINT32_(21)
#define MUX_PA21G_TCC0_WO1                         _UINT32_(6) 
#define PINMUX_PA21G_TCC0_WO1                      ((PIN_PA21G_TCC0_WO1 << 16) | MUX_PA21G_TCC0_WO1)
#define PORT_PA21G_TCC0_WO1                        (_UINT32_(1) << 21)

#define PIN_PB13G_TCC0_WO1                         _UINT32_(45)
#define MUX_PB13G_TCC0_WO1                         _UINT32_(6) 
#define PINMUX_PB13G_TCC0_WO1                      ((PIN_PB13G_TCC0_WO1 << 16) | MUX_PB13G_TCC0_WO1)
#define PORT_PB13G_TCC0_WO1                        (_UINT32_(1) << 13)

#define PIN_PA09F_TCC0_WO1                         _UINT32_(9) 
#define MUX_PA09F_TCC0_WO1                         _UINT32_(5) 
#define PINMUX_PA09F_TCC0_WO1                      ((PIN_PA09F_TCC0_WO1 << 16) | MUX_PA09F_TCC0_WO1)
#define PORT_PA09F_TCC0_WO1                        (_UINT32_(1) << 9)

