Microchip-MPLAB-Harmony/reference_apps/apps/pic32cx_sg61_cult/pic32cx_sg61_getting_started/firmware/src/packs/PIC32CX1025SG61128_DFP/pio/pic32cx1025sg61128.h
#define PIN_PC11F_TCC0_WO1                         _UINT32_(75)
#define MUX_PC11F_TCC0_WO1                         _UINT32_(5) 
#define PINMUX_PC11F_TCC0_WO1                      ((PIN_PC11F_TCC0_WO1 << 16) | MUX_PC11F_TCC0_WO1)
#define PORT_PC11F_TCC0_WO1                        (_UINT32_(1) << 11)

#define PIN_PC17F_TCC0_WO1                         _UINT32_(81)
#define MUX_PC17F_TCC0_WO1                         _UINT32_(5) 
#define PINMUX_PC17F_TCC0_WO1                      ((PIN_PC17F_TCC0_WO1 << 16) | MUX_PC17F_TCC0_WO1)
#define PORT_PC17F_TCC0_WO1                        (_UINT32_(1) << 17)

#define PIN_PD08F_TCC0_WO1                         _UINT32_(104)
#define MUX_PD08F_TCC0_WO1                         _UINT32_(5) 
#define PINMUX_PD08F_TCC0_WO1                      ((PIN_PD08F_TCC0_WO1 << 16) | MUX_PD08F_TCC0_WO1)
#define PORT_PD08F_TCC0_WO1                        (_UINT32_(1) << 8)

#define PIN_PA22G_TCC0_WO2                         _UINT32_(22)
#define MUX_PA22G_TCC0_WO2                         _UINT32_(6) 
#define PINMUX_PA22G_TCC0_WO2                      ((PIN_PA22G_TCC0_WO2 << 16) | MUX_PA22G_TCC0_WO2)
#define PORT_PA22G_TCC0_WO2                        (_UINT32_(1) << 22)

#define PIN_PB14G_TCC0_WO2                         _UINT32_(46)
#define MUX_PB14G_TCC0_WO2                         _UINT32_(6) 
#define PINMUX_PB14G_TCC0_WO2                      ((PIN_PB14G_TCC0_WO2 << 16) | MUX_PB14G_TCC0_WO2)
#define PORT_PB14G_TCC0_WO2                        (_UINT32_(1) << 14)

#define PIN_PA10F_TCC0_WO2                         _UINT32_(10)
#define MUX_PA10F_TCC0_WO2                         _UINT32_(5) 
#define PINMUX_PA10F_TCC0_WO2                      ((PIN_PA10F_TCC0_WO2 << 16) | MUX_PA10F_TCC0_WO2)
#define PORT_PA10F_TCC0_WO2                        (_UINT32_(1) << 10)

#define PIN_PC12F_TCC0_WO2                         _UINT32_(76)
#define MUX_PC12F_TCC0_WO2                         _UINT32_(5) 
#define PINMUX_PC12F_TCC0_WO2                      ((PIN_PC12F_TCC0_WO2 << 16) | MUX_PC12F_TCC0_WO2)
#define PORT_PC12F_TCC0_WO2                        (_UINT32_(1) << 12)

#define PIN_PC18F_TCC0_WO2                         _UINT32_(82)
#define MUX_PC18F_TCC0_WO2                         _UINT32_(5) 
#define PINMUX_PC18F_TCC0_WO2                      ((PIN_PC18F_TCC0_WO2 << 16) | MUX_PC18F_TCC0_WO2)
#define PORT_PC18F_TCC0_WO2                        (_UINT32_(1) << 18)

#define PIN_PD09F_TCC0_WO2                         _UINT32_(105)
#define MUX_PD09F_TCC0_WO2                         _UINT32_(5) 
#define PINMUX_PD09F_TCC0_WO2                      ((PIN_PD09F_TCC0_WO2 << 16) | MUX_PD09F_TCC0_WO2)
#define PORT_PD09F_TCC0_WO2                        (_UINT32_(1) << 9)

#define PIN_PA23G_TCC0_WO3                         _UINT32_(23)
#define MUX_PA23G_TCC0_WO3                         _UINT32_(6) 
#define PINMUX_PA23G_TCC0_WO3                      ((PIN_PA23G_TCC0_WO3 << 16) | MUX_PA23G_TCC0_WO3)
#define PORT_PA23G_TCC0_WO3                        (_UINT32_(1) << 23)

#define PIN_PB15G_TCC0_WO3                         _UINT32_(47)
#define MUX_PB15G_TCC0_WO3                         _UINT32_(6) 
#define PINMUX_PB15G_TCC0_WO3                      ((PIN_PB15G_TCC0_WO3 << 16) | MUX_PB15G_TCC0_WO3)
#define PORT_PB15G_TCC0_WO3                        (_UINT32_(1) << 15)

#define PIN_PA11F_TCC0_WO3                         _UINT32_(11)
#define MUX_PA11F_TCC0_WO3                         _UINT32_(5) 
#define PINMUX_PA11F_TCC0_WO3                      ((PIN_PA11F_TCC0_WO3 << 16) | MUX_PA11F_TCC0_WO3)
#define PORT_PA11F_TCC0_WO3                        (_UINT32_(1) << 11)

#define PIN_PC13F_TCC0_WO3                         _UINT32_(77)
#define MUX_PC13F_TCC0_WO3                         _UINT32_(5) 
#define PINMUX_PC13F_TCC0_WO3                      ((PIN_PC13F_TCC0_WO3 << 16) | MUX_PC13F_TCC0_WO3)
#define PORT_PC13F_TCC0_WO3                        (_UINT32_(1) << 13)

#define PIN_PC19F_TCC0_WO3                         _UINT32_(83)
#define MUX_PC19F_TCC0_WO3                         _UINT32_(5) 
#define PINMUX_PC19F_TCC0_WO3                      ((PIN_PC19F_TCC0_WO3 << 16) | MUX_PC19F_TCC0_WO3)
#define PORT_PC19F_TCC0_WO3                        (_UINT32_(1) << 19)

#define PIN_PD10F_TCC0_WO3                         _UINT32_(106)
#define MUX_PD10F_TCC0_WO3                         _UINT32_(5) 
#define PINMUX_PD10F_TCC0_WO3                      ((PIN_PD10F_TCC0_WO3 << 16) | MUX_PD10F_TCC0_WO3)
#define PORT_PD10F_TCC0_WO3                        (_UINT32_(1) << 10)

#define PIN_PA16G_TCC0_WO4                         _UINT32_(16)
#define MUX_PA16G_TCC0_WO4                         _UINT32_(6) 
#define PINMUX_PA16G_TCC0_WO4                      ((PIN_PA16G_TCC0_WO4 << 16) | MUX_PA16G_TCC0_WO4)
#define PORT_PA16G_TCC0_WO4                        (_UINT32_(1) << 16)

#define PIN_PB16G_TCC0_WO4                         _UINT32_(48)
#define MUX_PB16G_TCC0_WO4                         _UINT32_(6) 
#define PINMUX_PB16G_TCC0_WO4                      ((PIN_PB16G_TCC0_WO4 << 16) | MUX_PB16G_TCC0_WO4)
#define PORT_PB16G_TCC0_WO4                        (_UINT32_(1) << 16)

#define PIN_PB10F_TCC0_WO4                         _UINT32_(42)
#define MUX_PB10F_TCC0_WO4                         _UINT32_(5) 
#define PINMUX_PB10F_TCC0_WO4                      ((PIN_PB10F_TCC0_WO4 << 16) | MUX_PB10F_TCC0_WO4)
#define PORT_PB10F_TCC0_WO4                        (_UINT32_(1) << 10)

#define PIN_PC14F_TCC0_WO4                         _UINT32_(78)
#define MUX_PC14F_TCC0_WO4                         _UINT32_(5) 
#define PINMUX_PC14F_TCC0_WO4                      ((PIN_PC14F_TCC0_WO4 << 16) | MUX_PC14F_TCC0_WO4)
#define PORT_PC14F_TCC0_WO4                        (_UINT32_(1) << 14)

#define PIN_PC20F_TCC0_WO4                         _UINT32_(84)
#define MUX_PC20F_TCC0_WO4                         _UINT32_(5) 
#define PINMUX_PC20F_TCC0_WO4                      ((PIN_PC20F_TCC0_WO4 << 16) | MUX_PC20F_TCC0_WO4)
#define PORT_PC20F_TCC0_WO4                        (_UINT32_(1) << 20)

#define PIN_PD11F_TCC0_WO4                         _UINT32_(107)
#define MUX_PD11F_TCC0_WO4                         _UINT32_(5) 
#define PINMUX_PD11F_TCC0_WO4                      ((PIN_PD11F_TCC0_WO4 << 16) | MUX_PD11F_TCC0_WO4)
#define PORT_PD11F_TCC0_WO4                        (_UINT32_(1) << 11)

#define PIN_PA17G_TCC0_WO5                         _UINT32_(17)
#define MUX_PA17G_TCC0_WO5                         _UINT32_(6) 
#define PINMUX_PA17G_TCC0_WO5                      ((PIN_PA17G_TCC0_WO5 << 16) | MUX_PA17G_TCC0_WO5)
#define PORT_PA17G_TCC0_WO5                        (_UINT32_(1) << 17)

#define PIN_PB17G_TCC0_WO5                         _UINT32_(49)
#define MUX_PB17G_TCC0_WO5                         _UINT32_(6) 
#define PINMUX_PB17G_TCC0_WO5                      ((PIN_PB17G_TCC0_WO5 << 16) | MUX_PB17G_TCC0_WO5)
#define PORT_PB17G_TCC0_WO5                        (_UINT32_(1) << 17)

#define PIN_PB11F_TCC0_WO5                         _UINT32_(43)
#define MUX_PB11F_TCC0_WO5                         _UINT32_(5) 
#define PINMUX_PB11F_TCC0_WO5                      ((PIN_PB11F_TCC0_WO5 << 16) | MUX_PB11F_TCC0_WO5)
#define PORT_PB11F_TCC0_WO5                        (_UINT32_(1) << 11)

#define PIN_PC15F_TCC0_WO5                         _UINT32_(79)
#define MUX_PC15F_TCC0_WO5                         _UINT32_(5) 
#define PINMUX_PC15F_TCC0_WO5                      ((PIN_PC15F_TCC0_WO5 << 16) | MUX_PC15F_TCC0_WO5)
#define PORT_PC15F_TCC0_WO5                        (_UINT32_(1) << 15)

#define PIN_PC21F_TCC0_WO5                         _UINT32_(85)
#define MUX_PC21F_TCC0_WO5                         _UINT32_(5) 
#define PINMUX_PC21F_TCC0_WO5                      ((PIN_PC21F_TCC0_WO5 << 16) | MUX_PC21F_TCC0_WO5)
#define PORT_PC21F_TCC0_WO5                        (_UINT32_(1) << 21)

#define PIN_PD12F_TCC0_WO5                         _UINT32_(108)
#define MUX_PD12F_TCC0_WO5                         _UINT32_(5) 
#define PINMUX_PD12F_TCC0_WO5                      ((PIN_PD12F_TCC0_WO5 << 16) | MUX_PD12F_TCC0_WO5)
#define PORT_PD12F_TCC0_WO5                        (_UINT32_(1) << 12)

