Microchip-MPLAB-Harmony/reference_apps/apps/pic32cx_sg61_cult/pic32cx_sg61_getting_started/firmware/src/packs/PIC32CX1025SG61128_DFP/pio/pic32cx1025sg61128.h
#define PIN_PA18G_TCC0_WO6                         _UINT32_(18)
#define MUX_PA18G_TCC0_WO6                         _UINT32_(6) 
#define PINMUX_PA18G_TCC0_WO6                      ((PIN_PA18G_TCC0_WO6 << 16) | MUX_PA18G_TCC0_WO6)
#define PORT_PA18G_TCC0_WO6                        (_UINT32_(1) << 18)

#define PIN_PB30G_TCC0_WO6                         _UINT32_(62)
#define MUX_PB30G_TCC0_WO6                         _UINT32_(6) 
#define PINMUX_PB30G_TCC0_WO6                      ((PIN_PB30G_TCC0_WO6 << 16) | MUX_PB30G_TCC0_WO6)
#define PORT_PB30G_TCC0_WO6                        (_UINT32_(1) << 30)

#define PIN_PA12F_TCC0_WO6                         _UINT32_(12)
#define MUX_PA12F_TCC0_WO6                         _UINT32_(5) 
#define PINMUX_PA12F_TCC0_WO6                      ((PIN_PA12F_TCC0_WO6 << 16) | MUX_PA12F_TCC0_WO6)
#define PORT_PA12F_TCC0_WO6                        (_UINT32_(1) << 12)

#define PIN_PC22F_TCC0_WO6                         _UINT32_(86)
#define MUX_PC22F_TCC0_WO6                         _UINT32_(5) 
#define PINMUX_PC22F_TCC0_WO6                      ((PIN_PC22F_TCC0_WO6 << 16) | MUX_PC22F_TCC0_WO6)
#define PORT_PC22F_TCC0_WO6                        (_UINT32_(1) << 22)

#define PIN_PA19G_TCC0_WO7                         _UINT32_(19)
#define MUX_PA19G_TCC0_WO7                         _UINT32_(6) 
#define PINMUX_PA19G_TCC0_WO7                      ((PIN_PA19G_TCC0_WO7 << 16) | MUX_PA19G_TCC0_WO7)
#define PORT_PA19G_TCC0_WO7                        (_UINT32_(1) << 19)

#define PIN_PB31G_TCC0_WO7                         _UINT32_(63)
#define MUX_PB31G_TCC0_WO7                         _UINT32_(6) 
#define PINMUX_PB31G_TCC0_WO7                      ((PIN_PB31G_TCC0_WO7 << 16) | MUX_PB31G_TCC0_WO7)
#define PORT_PB31G_TCC0_WO7                        (_UINT32_(1) << 31)

#define PIN_PA13F_TCC0_WO7                         _UINT32_(13)
#define MUX_PA13F_TCC0_WO7                         _UINT32_(5) 
#define PINMUX_PA13F_TCC0_WO7                      ((PIN_PA13F_TCC0_WO7 << 16) | MUX_PA13F_TCC0_WO7)
#define PORT_PA13F_TCC0_WO7                        (_UINT32_(1) << 13)

#define PIN_PC23F_TCC0_WO7                         _UINT32_(87)
#define MUX_PC23F_TCC0_WO7                         _UINT32_(5) 
#define PINMUX_PC23F_TCC0_WO7                      ((PIN_PC23F_TCC0_WO7 << 16) | MUX_PC23F_TCC0_WO7)
#define PORT_PC23F_TCC0_WO7                        (_UINT32_(1) << 23)

/* ========== PORT definition for TCC1 peripheral ========== */
#define PIN_PB10G_TCC1_WO0                         _UINT32_(42)
#define MUX_PB10G_TCC1_WO0                         _UINT32_(6) 
#define PINMUX_PB10G_TCC1_WO0                      ((PIN_PB10G_TCC1_WO0 << 16) | MUX_PB10G_TCC1_WO0)
#define PORT_PB10G_TCC1_WO0                        (_UINT32_(1) << 10)

#define PIN_PC14G_TCC1_WO0                         _UINT32_(78)
#define MUX_PC14G_TCC1_WO0                         _UINT32_(6) 
#define PINMUX_PC14G_TCC1_WO0                      ((PIN_PC14G_TCC1_WO0 << 16) | MUX_PC14G_TCC1_WO0)
#define PORT_PC14G_TCC1_WO0                        (_UINT32_(1) << 14)

#define PIN_PA16F_TCC1_WO0                         _UINT32_(16)
#define MUX_PA16F_TCC1_WO0                         _UINT32_(5) 
#define PINMUX_PA16F_TCC1_WO0                      ((PIN_PA16F_TCC1_WO0 << 16) | MUX_PA16F_TCC1_WO0)
#define PORT_PA16F_TCC1_WO0                        (_UINT32_(1) << 16)

#define PIN_PB18F_TCC1_WO0                         _UINT32_(50)
#define MUX_PB18F_TCC1_WO0                         _UINT32_(5) 
#define PINMUX_PB18F_TCC1_WO0                      ((PIN_PB18F_TCC1_WO0 << 16) | MUX_PB18F_TCC1_WO0)
#define PORT_PB18F_TCC1_WO0                        (_UINT32_(1) << 18)

#define PIN_PD20F_TCC1_WO0                         _UINT32_(116)
#define MUX_PD20F_TCC1_WO0                         _UINT32_(5) 
#define PINMUX_PD20F_TCC1_WO0                      ((PIN_PD20F_TCC1_WO0 << 16) | MUX_PD20F_TCC1_WO0)
#define PORT_PD20F_TCC1_WO0                        (_UINT32_(1) << 20)

#define PIN_PB11G_TCC1_WO1                         _UINT32_(43)
#define MUX_PB11G_TCC1_WO1                         _UINT32_(6) 
#define PINMUX_PB11G_TCC1_WO1                      ((PIN_PB11G_TCC1_WO1 << 16) | MUX_PB11G_TCC1_WO1)
#define PORT_PB11G_TCC1_WO1                        (_UINT32_(1) << 11)

#define PIN_PC15G_TCC1_WO1                         _UINT32_(79)
#define MUX_PC15G_TCC1_WO1                         _UINT32_(6) 
#define PINMUX_PC15G_TCC1_WO1                      ((PIN_PC15G_TCC1_WO1 << 16) | MUX_PC15G_TCC1_WO1)
#define PORT_PC15G_TCC1_WO1                        (_UINT32_(1) << 15)

#define PIN_PA17F_TCC1_WO1                         _UINT32_(17)
#define MUX_PA17F_TCC1_WO1                         _UINT32_(5) 
#define PINMUX_PA17F_TCC1_WO1                      ((PIN_PA17F_TCC1_WO1 << 16) | MUX_PA17F_TCC1_WO1)
#define PORT_PA17F_TCC1_WO1                        (_UINT32_(1) << 17)

#define PIN_PB19F_TCC1_WO1                         _UINT32_(51)
#define MUX_PB19F_TCC1_WO1                         _UINT32_(5) 
#define PINMUX_PB19F_TCC1_WO1                      ((PIN_PB19F_TCC1_WO1 << 16) | MUX_PB19F_TCC1_WO1)
#define PORT_PB19F_TCC1_WO1                        (_UINT32_(1) << 19)

#define PIN_PD21F_TCC1_WO1                         _UINT32_(117)
#define MUX_PD21F_TCC1_WO1                         _UINT32_(5) 
#define PINMUX_PD21F_TCC1_WO1                      ((PIN_PD21F_TCC1_WO1 << 16) | MUX_PD21F_TCC1_WO1)
#define PORT_PD21F_TCC1_WO1                        (_UINT32_(1) << 21)

#define PIN_PA12G_TCC1_WO2                         _UINT32_(12)
#define MUX_PA12G_TCC1_WO2                         _UINT32_(6) 
#define PINMUX_PA12G_TCC1_WO2                      ((PIN_PA12G_TCC1_WO2 << 16) | MUX_PA12G_TCC1_WO2)
#define PORT_PA12G_TCC1_WO2                        (_UINT32_(1) << 12)

#define PIN_PA14G_TCC1_WO2                         _UINT32_(14)
#define MUX_PA14G_TCC1_WO2                         _UINT32_(6) 
#define PINMUX_PA14G_TCC1_WO2                      ((PIN_PA14G_TCC1_WO2 << 16) | MUX_PA14G_TCC1_WO2)
#define PORT_PA14G_TCC1_WO2                        (_UINT32_(1) << 14)

