Microchip-MPLAB-Harmony/reference_apps/apps/pic32cx_sg61_cult/pic32cx_sg61_getting_started/firmware/src/packs/PIC32CX1025SG61128_DFP/pio/pic32cx1025sg61128.h
#define PIN_PA18F_TCC1_WO2                         _UINT32_(18)
#define MUX_PA18F_TCC1_WO2                         _UINT32_(5) 
#define PINMUX_PA18F_TCC1_WO2                      ((PIN_PA18F_TCC1_WO2 << 16) | MUX_PA18F_TCC1_WO2)
#define PORT_PA18F_TCC1_WO2                        (_UINT32_(1) << 18)

#define PIN_PB20F_TCC1_WO2                         _UINT32_(52)
#define MUX_PB20F_TCC1_WO2                         _UINT32_(5) 
#define PINMUX_PB20F_TCC1_WO2                      ((PIN_PB20F_TCC1_WO2 << 16) | MUX_PB20F_TCC1_WO2)
#define PORT_PB20F_TCC1_WO2                        (_UINT32_(1) << 20)

#define PIN_PA13G_TCC1_WO3                         _UINT32_(13)
#define MUX_PA13G_TCC1_WO3                         _UINT32_(6) 
#define PINMUX_PA13G_TCC1_WO3                      ((PIN_PA13G_TCC1_WO3 << 16) | MUX_PA13G_TCC1_WO3)
#define PORT_PA13G_TCC1_WO3                        (_UINT32_(1) << 13)

#define PIN_PA15G_TCC1_WO3                         _UINT32_(15)
#define MUX_PA15G_TCC1_WO3                         _UINT32_(6) 
#define PINMUX_PA15G_TCC1_WO3                      ((PIN_PA15G_TCC1_WO3 << 16) | MUX_PA15G_TCC1_WO3)
#define PORT_PA15G_TCC1_WO3                        (_UINT32_(1) << 15)

#define PIN_PA19F_TCC1_WO3                         _UINT32_(19)
#define MUX_PA19F_TCC1_WO3                         _UINT32_(5) 
#define PINMUX_PA19F_TCC1_WO3                      ((PIN_PA19F_TCC1_WO3 << 16) | MUX_PA19F_TCC1_WO3)
#define PORT_PA19F_TCC1_WO3                        (_UINT32_(1) << 19)

#define PIN_PB21F_TCC1_WO3                         _UINT32_(53)
#define MUX_PB21F_TCC1_WO3                         _UINT32_(5) 
#define PINMUX_PB21F_TCC1_WO3                      ((PIN_PB21F_TCC1_WO3 << 16) | MUX_PB21F_TCC1_WO3)
#define PORT_PB21F_TCC1_WO3                        (_UINT32_(1) << 21)

#define PIN_PA08G_TCC1_WO4                         _UINT32_(8) 
#define MUX_PA08G_TCC1_WO4                         _UINT32_(6) 
#define PINMUX_PA08G_TCC1_WO4                      ((PIN_PA08G_TCC1_WO4 << 16) | MUX_PA08G_TCC1_WO4)
#define PORT_PA08G_TCC1_WO4                        (_UINT32_(1) << 8)

#define PIN_PC10G_TCC1_WO4                         _UINT32_(74)
#define MUX_PC10G_TCC1_WO4                         _UINT32_(6) 
#define PINMUX_PC10G_TCC1_WO4                      ((PIN_PC10G_TCC1_WO4 << 16) | MUX_PC10G_TCC1_WO4)
#define PORT_PC10G_TCC1_WO4                        (_UINT32_(1) << 10)

#define PIN_PA20F_TCC1_WO4                         _UINT32_(20)
#define MUX_PA20F_TCC1_WO4                         _UINT32_(5) 
#define PINMUX_PA20F_TCC1_WO4                      ((PIN_PA20F_TCC1_WO4 << 16) | MUX_PA20F_TCC1_WO4)
#define PORT_PA20F_TCC1_WO4                        (_UINT32_(1) << 20)

#define PIN_PA09G_TCC1_WO5                         _UINT32_(9) 
#define MUX_PA09G_TCC1_WO5                         _UINT32_(6) 
#define PINMUX_PA09G_TCC1_WO5                      ((PIN_PA09G_TCC1_WO5 << 16) | MUX_PA09G_TCC1_WO5)
#define PORT_PA09G_TCC1_WO5                        (_UINT32_(1) << 9)

#define PIN_PC11G_TCC1_WO5                         _UINT32_(75)
#define MUX_PC11G_TCC1_WO5                         _UINT32_(6) 
#define PINMUX_PC11G_TCC1_WO5                      ((PIN_PC11G_TCC1_WO5 << 16) | MUX_PC11G_TCC1_WO5)
#define PORT_PC11G_TCC1_WO5                        (_UINT32_(1) << 11)

#define PIN_PA21F_TCC1_WO5                         _UINT32_(21)
#define MUX_PA21F_TCC1_WO5                         _UINT32_(5) 
#define PINMUX_PA21F_TCC1_WO5                      ((PIN_PA21F_TCC1_WO5 << 16) | MUX_PA21F_TCC1_WO5)
#define PORT_PA21F_TCC1_WO5                        (_UINT32_(1) << 21)

#define PIN_PA10G_TCC1_WO6                         _UINT32_(10)
#define MUX_PA10G_TCC1_WO6                         _UINT32_(6) 
#define PINMUX_PA10G_TCC1_WO6                      ((PIN_PA10G_TCC1_WO6 << 16) | MUX_PA10G_TCC1_WO6)
#define PORT_PA10G_TCC1_WO6                        (_UINT32_(1) << 10)

#define PIN_PC12G_TCC1_WO6                         _UINT32_(76)
#define MUX_PC12G_TCC1_WO6                         _UINT32_(6) 
#define PINMUX_PC12G_TCC1_WO6                      ((PIN_PC12G_TCC1_WO6 << 16) | MUX_PC12G_TCC1_WO6)
#define PORT_PC12G_TCC1_WO6                        (_UINT32_(1) << 12)

#define PIN_PA22F_TCC1_WO6                         _UINT32_(22)
#define MUX_PA22F_TCC1_WO6                         _UINT32_(5) 
#define PINMUX_PA22F_TCC1_WO6                      ((PIN_PA22F_TCC1_WO6 << 16) | MUX_PA22F_TCC1_WO6)
#define PORT_PA22F_TCC1_WO6                        (_UINT32_(1) << 22)

#define PIN_PA11G_TCC1_WO7                         _UINT32_(11)
#define MUX_PA11G_TCC1_WO7                         _UINT32_(6) 
#define PINMUX_PA11G_TCC1_WO7                      ((PIN_PA11G_TCC1_WO7 << 16) | MUX_PA11G_TCC1_WO7)
#define PORT_PA11G_TCC1_WO7                        (_UINT32_(1) << 11)

#define PIN_PC13G_TCC1_WO7                         _UINT32_(77)
#define MUX_PC13G_TCC1_WO7                         _UINT32_(6) 
#define PINMUX_PC13G_TCC1_WO7                      ((PIN_PC13G_TCC1_WO7 << 16) | MUX_PC13G_TCC1_WO7)
#define PORT_PC13G_TCC1_WO7                        (_UINT32_(1) << 13)

#define PIN_PA23F_TCC1_WO7                         _UINT32_(23)
#define MUX_PA23F_TCC1_WO7                         _UINT32_(5) 
#define PINMUX_PA23F_TCC1_WO7                      ((PIN_PA23F_TCC1_WO7 << 16) | MUX_PA23F_TCC1_WO7)
#define PORT_PA23F_TCC1_WO7                        (_UINT32_(1) << 23)

/* ========== PORT definition for TCC2 peripheral ========== */
#define PIN_PA14F_TCC2_WO0                         _UINT32_(14)
#define MUX_PA14F_TCC2_WO0                         _UINT32_(5) 
#define PINMUX_PA14F_TCC2_WO0                      ((PIN_PA14F_TCC2_WO0 << 16) | MUX_PA14F_TCC2_WO0)
#define PORT_PA14F_TCC2_WO0                        (_UINT32_(1) << 14)

#define PIN_PA30F_TCC2_WO0                         _UINT32_(30)
#define MUX_PA30F_TCC2_WO0                         _UINT32_(5) 
#define PINMUX_PA30F_TCC2_WO0                      ((PIN_PA30F_TCC2_WO0 << 16) | MUX_PA30F_TCC2_WO0)
#define PORT_PA30F_TCC2_WO0                        (_UINT32_(1) << 30)

